example/src/Documents/Демо_Сообщение/Демо_Сообщение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Демо_Сообщение</name>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>DocumentRef.Демо_Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелоСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОтвета</name>
    <type>
      <types>DocumentRef.Демо_Сообщение</types>
    </type>
  </attributes>
</mdclass:Document>

example/src/CommonModules/Демо_Заявки/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

// Параметры создания заявки.
// 
// Параметры:
//  Параметры - см. Документы.Демо_Заявка.НовыеДанные
// 
// Возвращаемое значение:
//  ДокументСсылка.Демо_Заявка
Функция СоздатьЗаявку(Параметры) Экспорт
	НачатьТранзакцию();
	Попытка
		Заявка = Документы.Демо_Заявка.СоздатьДокумент();
		Заявка.Заполнить(Параметры);
		
		Если Не Заявка.ПроверитьЗаполнение() Тогда
			ВызватьИсключение "Документ не прошел проверку заполнения";
		КонецЕсли;
		
		Заявка.Записать();
		ЗаявкаСсылка = Заявка.Ссылка;
		ТекстСообщения = Параметры.Сообщение; // Строка
		СоздатьСообщение(ЗаявкаСсылка, ТекстСообщения);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ЗаявкаСсылка;
КонецФункции

// Создать сообщение.
// 
// Параметры:
//  Заявка - ДокументСсылка.Демо_Заявка
//  ТекстСообщения - Строка
//  СообщениеОтвета - ДокументСсылка.Демо_Сообщение
// 
// Возвращаемое значение:
//  ДокументСсылка.Демо_Сообщение
Функция СоздатьСообщение(Заявка, ТекстСообщения, СообщениеОтвета = Неопределено) Экспорт
	
	СообщениеОбъект = Документы.Демо_Сообщение.СоздатьДокумент();
	СообщениеОбъект.Заполнить(Неопределено);
	СообщениеОбъект.Запрос = Заявка;
	СообщениеОбъект.ТелоСообщения = ТекстСообщения;
	СообщениеОбъект.СообщениеОтвета = СообщениеОтвета;
	СообщениеОбъект.Записать();
	
	Возврат СообщениеОбъект.Ссылка;
	
КонецФункции

#КонецОбласти
